# List1: მხოლოდ 1 ელემენტი
list1 = [1]
# დადებითი ინდექსები:  0
# უარყოფითი ინდექსები: -1

# List2: 2 ელემენტი
list2 = [1, 2]
# დადებითი ინდექსები:  0,  1
# უარყოფითი ინდექსები: -2, -1

# List3: 3 ელემენტი
list3 = [1, 2, 3]
# დადებითი ინდექსები:  0,  1,  2
# უარყოფითი ინდექსები: -3, -2, -1

# List4: 4 ელემენტი
list4 = [1, 2, 3, 4]
# დადებითი ინდექსები:  0,  1,  2,  3
# უარყოფითი ინდექსები: -4, -3, -2, -1

# List5: 5 ელემენტი
list5 = [1, 2, 3, 4, 5]
# დადებითი ინდექსები:  0,  1,  2,  3,  4
# უარყოფითი ინდექსები: -5, -4, -3, -2, -1

# List6: 6 ელემენტი
list6 = [1, 2, 3, 4, 5, 6]
# დადებითი ინდექსები:  0,  1,  2,  3,  4,  5
# უარყოფითი ინდექსები: -6, -5, -4, -3, -2, -1

# List7: 7 ელემენტი
list7 = [1, 2, 3, 4, 5, 6, 7]
# დადებითი ინდექსები:  0,  1,  2,  3,  4,  5,  6
# უარყოფითი ინდექსები: -7, -6, -5, -4, -3, -2, -1

# List8: 8 ელემენტი
list8 = [1, 2, 3, 4, 5, 6, 7, 8]
# დადებითი ინდექსები:  0,  1,  2,  3,  4,  5,  6,  7
# უარყოფითი ინდექსები: -8, -7, -6, -5, -4, -3, -2, -1

# List9: 9 ელემენტი
list9 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
# დადებითი ინდექსები:  0,  1,  2,  3,  4,  5,  6,  7,  8
# უარყოფითი ინდექსები: -9, -8, -7, -6, -5, -4, -3, -2, -1

# List10: 10 ელემენტი
list10 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# დადებითი ინდექსები:  0,  1,  2,  3,  4,  5,  6,  7,  8,  9
# უარყოფითი ინდექსები: -10, -9, -8, -7, -6, -5, -4, -3, -2, -1


list1 = [1]



list2 = [1, 2]



list3 = [1, 2, 3]



list4 = [1, 2, 3, 4]


list5 = [1, 2, 3, 4, 5]


list6 = [1, 2, 3, 4, 5, 6]


list7 = [1, 2, 3, 4, 5, 6, 7]



list8 = [1, 2, 3, 4, 5, 6, 7, 8]



list9 = [1, 2, 3, 4, 5, 6, 7, 8, 9]



list10 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]





















